Revit 2026 API

# RevitLinkUIUtilsReportLinkLoadResults Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void ReportLinkLoadResults(
	Document doc,
	IDictionary<string, LinkLoadResult> loadResults
)
```
```vb
Public Shared Sub ReportLinkLoadResults (
	doc As Document,
	loadResults As IDictionary(Of String, LinkLoadResult)
)
```
```cpp
public:
static void ReportLinkLoadResults(
	Document^ doc,
	IDictionary<String^, LinkLoadResult^>^ loadResults
)
```
```fsharp
static member ReportLinkLoadResults :
        doc : Document *
        loadResults : IDictionary<string, LinkLoadResult> -> unit
```

#### Parameters

doc Document

loadResults IDictionaryString, LinkLoadResult

#### Reference

RevitLinkUIUtils Class

Autodesk.Revit.UI Namespace